import 'dart:math';

import 'package:flutter/foundation.dart';

class ProphitWords with ChangeNotifier {
  final List<String> hadithWords = [
    'سُئِلَتْ عائِشةُ عن خُلُقِ رسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فقالَتْ: كان خُلُقُه القُرآنَ',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ مِن أحبِّكم إليَّ وأقربِكُم منِّي مجلسًا يومَ القيامةِ أحاسنَكُم أخلاقًا)',
    'قال رسول الله صلى الله عليه وسلم: (أَلَا أُخْبِرُكَ بأَحَبِّ الكَلَامِ إلى اللهِ؟ قُلتُ: يا رَسُولَ اللهِ، أَخْبِرْنِي بأَحَبِّ الكَلَامِ إلى اللهِ، فَقالَ: إنَّ أَحَبَّ الكَلَامِ إلى اللهِ: سُبْحَانَ اللهِ وَبِحَمْدِهِ).[٤] قال رسول الله صلى الله عليه وسلم: (لأَنْ أَقُولَ سُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، أَحَبُّ إِلَيَّ ممَّا طَلَعَتْ عليه الشَّمْسُ).',
    'قال رسول الله صلى الله عليه وسلم: (مَن سَبَّحَ اللَّهَ في دُبُرِ كُلِّ صَلاةٍ ثَلاثًا وثَلاثِينَ، وحَمِدَ اللَّهَ ثَلاثًا وثَلاثِينَ، وكَبَّرَ اللَّهَ ثَلاثًا وثَلاثِينَ، فَتْلِكَ تِسْعَةٌ وتِسْعُونَ، وقالَ: تَمامَ المِئَةِ: لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ وله الحَمْدُ وهو علَى كُلِّ شيءٍ قَدِيرٌ غُفِرَتْ خَطاياهُ وإنْ كانَتْ مِثْلَ زَبَدِ البَحْرِ).',
    'قال رسول الله صلى الله عليه وسلم: (مَنْ قال لا إلهَ إلَّا اللهُ وحدَهُ لَا شرِيكَ لَهُ، لَهُ الملْكُ، ولَهُ الحمْدُ، وهُوَ عَلَى كُلِّ شيءٍ قديرٌ، فِي يومٍ مائَةَ مرةٍ، كانتْ لَهُ عِدْلَ عشرِ رقابٍ، وكُتِبَتْ لَهُ مائَةُ حسنَةٍ، ومُحِيَتْ عنه مائَةُ سيِّئَةٍ، وكانَتْ لَهُ حِرْزًا منَ الشيطانِ يَوْمَهُ ذَلِكَ حتى يُمْسِيَ، ولم يأتِ أحدٌ بأفضلَ مِمَّا جاءَ بِهِ، إلَّا أحدٌ عَمِلَ عملًا أكثرَ مِنْ ذلِكَ)',
    'قال رسول الله -صلى الله عليه وسلم- في حديث السبعة الذين يظلهم الله في ظله في الآخرة: (ورَجُلٌ تَصَدَّقَ بصَدَقَةٍ فأخْفاها حتَّى لا تَعْلَمَ يَمِينُهُ ما تُنْفِقُ شِمالُهُ)',
    'قال رسول الله صلى الله عليه وسلم: (ما مِن يَومٍ يُصْبِحُ العِبادُ فِيهِ، إلَّا مَلَكانِ يَنْزِلانِ، فيَقولُ أحَدُهُما: اللَّهُمَّ أعْطِ مُنْفِقًا خَلَفًا، ويقولُ الآخَرُ: اللَّهُمَّ أعْطِ مُمْسِكًا تَلَفًا)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّما الدُّنيا لأربعةِ نفرٍ عبدٍ رزقَهُ اللَّهُ مالًا وعلمًا فَهوَ يتَّقي ربَّهُ فيهِ ويصلُ فيهِ رحمَهُ ويعلمُ للَّهِ فيهِ حقًّا فَهذا بأفضلِ المنازلِ)',
    'قال رسول الله صلى الله عليه وسلم: (إنْ أردتَ أنْ يَلينَ قلبُكَ، فأطعِمْ المسكينَ، وامسحْ رأسَ اليتيمِ)',
    'قال رسول الله صلى الله عليه وسلم: (الرَّجلُ في ظلِّ صدقتِه حتَّى يُقضَى بين النَّاسِ)',
    'قال رسول الله صلى الله عليه وسلم: (والصدقة تطفيء الخطيئة، كما يطفئ الماء النار)',
    'قال رسول الله صلى الله عليه وسلم: (ما نقصت صدقة من مال)',
    'قال رسول الله صلى الله عليه وسلم: (دَاوُوا مَرضاكُمْ بِالصَّدقةِ)',
    'رُوي عن عبد الله بن عمرو -رضي الله عنه- أنه قال: (لَمْ يَكُنِ النبيُّ صَلَّى اللهُ عليه وسلَّمَ فَاحِشًا ولَا مُتَفَحِّشًا، وكانَ يقولُ: إنَّ مِن خِيَارِكُمْ أحْسَنَكُمْ أخْلَاقًا)',
    'قال رسول الله صلى الله عليه وسلم: (ما مِن شيءٍ أثقلُ في الميزانِ من حُسنِ الخُلُقِ)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ مِن أحبِّكم إليَّ وأقربِكُم منِّي مجلسًا يومَ القيامةِ أحاسنَكُم أخلاقًا)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ المؤمنَ ليُدْرِكُ بحُسْنِ خُلُقِه درجةَ الصَّائمِ القائمِ)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ أكملَ أو من أكملِ المؤمنين إيمانًا أحسنُهم خُلقًا)',
    'سُئل رسول الله -صلى الله عليه وسلم- عن أكثر شيء يُدخل الناس الجنة، فقال: (تَقْوَى اللهِ وحُسْنُ الخُلُقِ)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّما بُعِثْتُ لأُتممَ صالحَ الأخلاقِ)',
  ];

  String getRandomHadith() {
    int randNumber = Random().nextInt(hadithWords.length - 1);
    return hadithWords[randNumber];
  }
}
