import 'package:flutter/material.dart';

class Constants {
/*---------------------------------------------------------------------------------------------*/
/*-------------------------------------- time zone  ------------------------------------------*/
/*---------------------------------------------------------------------------------------------*/
  static final double timeZone = 2.0;
}

/*---------------------------------------------------------------------------------------------*/
/*---------------------------------- App Custom Colors ----------------------------------------*/
/*---------------------------------------------------------------------------------------------*/
final Color primaryColor = Colors.blue[900];
final Color kSecondaryColor = Color.fromARGB(255, 130, 196, 250);

/*---------------------------------------------------------------------------------------------*/
/*---------------------------------- App Carousel type ----------------------------------------*/
/*---------------------------------------------------------------------------------------------*/
// enum CarouselType { Morning, Night }

const String appName = 'ربح الآخرة';
const String errorMsg = 'حدث خطأ برجاء التأكد من شبكة الإنترنت و إعادة المحاولة';

const double kBorderRadius = 16.0;

final Color redColor = Colors.red[600];
final Color greenColor = Colors.greenAccent[700];
